docs/tomoko/README.org
#+OPTIONS: ^:{}
#+STARTUP: indent nolineimages
#+TITLE: memoソフトmy_helpの開発
#+AUTHOR: 山田
#+EMAIL:     (concat "nishitani@kwansei.ac.jp")
#+LANGUAGE:  jp
#+OPTIONS:   H:4 toc:t num:2

#+SETUPFILE: /Users/bob/Github/org-html-themes/setup/theme-readtheorg-local-daddygongon.setup

* はじめに
私たちは，何か知識を得たときには度々メモを取る．しかし，そのメモの場所が思い出せない，あるいはメモを紛失した経験がある．
あるいは，何度も同じことをwebで検索することもある．
そこで，探す手間や紛失する可能性を無くすためにmy_helpというmemoソフトを開発した．

* 手法
** my_helpの開発コンセプト
ヒトの脳ではキーワードが手がかりとなって，違う分類，別の階層の知識，記憶を思い出す．
my_helpは，これを模倣し，コンピュータの中にある分類化，階層化された知識を直交補空間として呼び出すことができるシステムである．

** my_helpの特徴
my_helpはemacsのMarkdownであるorg-modeを利用したソフトなので，長文やlatex，htmlにも対応している．
org-modeで作成した文章はemacs以外でも利用できる．
例えば，githubでは.mdと同じ様に.orgに対応している．

org-modeのexport機能を利用すればHTMLやLaTexなど様々なフォーマットに変換可能である．
(https://qiita.com/dwarfJP/items/594a8d4b0ac6d248d1e4)

my_helpを使うにあたり，emacsとorg-modeの使い方をmasterしなければならない．



** my_helpの振る舞い
CUI/CLIのようにterminal上で動かすことができるので，
commandで呼び出すとすぐに起動する．

terminal上でmy_help file名と打つと起動する．
file名の前に以下の命令を書き，実行する．

- delete :: delete HELP_NAME help
- edit :: edit HELP_NAME help, emacsを使ってorg-modeで編集
- list :: list all helps, specific HELP, or item
- new :: make new HELP_NAME help

* my_help 課題，開発目標

my_helpは時々動かなくなることがある．ファイルは作成されているのにも関わらず，ファイルがディレクトリに存在しないというエラーが起こる．

コードを上部分から下部分に書き換えて，versionを更新．


#+begin_src ruby
<       p target_help = File.join(@local_help_dir,file+'.org')
<       if local_help_entries.member?(file+'.org')
<         system "emacs #{target_help}"
<       else
<         puts "file #{target_help} does not exits in #{@local_help_dir}."
<         puts "init #{file} first."
---
>       target_help = File.join(@local_help_dir,file)
>       ['.yml','.org'].each do |ext|
>         p target_help += ext if local_help_entries.member?(file+ext)
#+end_src

現在，my_helpは自身の知識だけをmemoとして残すことができる．しかし，より効率的な知識の習得方法として，アクティブラーニングが挙げられる．
my_help内にある知識を共有できるようなシステムを開発することが今後の目標である．

加えて，共有することのより，他人の進捗状況を把握できるようになる．
進捗管理することによって学習を強制することができる．

** アクティブラーニング
- 今の日本の教育ではあまり馴染みがない．
テキストや教授者から知識を得るのではなく，自らも参加者になって知識を共有する．
- AM(acquisition metaphor)
- PM(participation metaphor): 学習あるいは学習者は参加者．学会活動もこれ．研究者が学会で認められるということは，その分野での用語を使って参加者とコミュニケーションを取れることであり．．．
  論文集を出すことや初心者向けのテキストを書いたりする活動も学習支援のひとつ．

|                 | acquisition metaphor         | participation metaphor    |   
|-----------------+------------------------------+---------------------------|
| 学習目標        | 個々を豊かにする             | 共同体の構築              |   
|-----------------+------------------------------+---------------------------|
| 学習とは？      | 何かを獲得する(acquisition)) | 参加者(participant)となる |   
|-----------------+------------------------------+---------------------------|    
| 学習者(student) | 受容者(消費者)，再構築者　   | 周辺にいる参加者，徒弟    |   
|-----------------+------------------------------+---------------------------|
| 教授者(teacher) | 供給者，まとめ役，媒介者     | 実践や論考の修得者        |   
|                 |                              |                           |   
|-----------------+------------------------------+---------------------------|
| 知識，概念      | 資産，所有物，一般商品       | 実践，論考，活動の一側面  |   
|                 | (個人のあるいは公共の)       |                           |   
|-----------------+------------------------------+---------------------------|
| 知るとは        | 持つ，所有すること           | 所属する，参加する，      |   
|                 |                              | コミュニケートすること    |   
|-----------------+------------------------------+---------------------------| 


*** 内世界，外世界
- 内世界は自分の中の知識

- 外世界はテキストや論文などの知識      
